import React from 'react';
import './features.css';
import { Feature } from '../../components';

const featuresData = [
  {
    title: "لماذا عين !؟",
    text: "في عالمٍ مليءٍ بالنداءات والدعوات صاخبٍ بالضجيج والتيارات تشغلنا فيه الحيرة والتساؤلات نحتاج إلى عين... عينٍ صافيةٍ عذبةٍ ننهل منها لنروي ظمأ أسئلتنا، عن الوجود والحياة، عن دورنا فيها، عن السعادة ما هي وكيف نجنيها !؟ عن الإنسان ما هو !؟ وإلى أين يسير؟"
  },
  {
    title: "لماذا أيضا !؟",
    text: "في عصر انفجار المعلومات وكثرة العلوم والخرافات واختلاط الحق بالهرطقات نحتاج إلى عين...عينٍ ناقدةٍ فاحصةٍ، تعلم أن أغلى ما يملكه الإنسان هو فكره، وأن أكثر ما تراه حولها هو هراء، أمّا ما يستحق أن تبني به الفكر فهو مثل تبر الذهب بين الأتربة والأوساخ، نحتاج إلى عينٍ فارزةٍ للذهب."
  },
  {
    title: "ولماذا أيضا !؟",
    text: "في عالمٍ كثرت فيه الأدوات وتفاوتت فيه الهمم والإمكانيات وكثرت فيه المصائب والإحباطات نحتاج إلى عين... عينٍ حالمةٍ متفائلةٍ تنظر إلى الواقع فتفهمه لتسافر إلى المستقبل، تمتلك أدوات التغيير والفهم، كما تمتلك القدرة على الحكم، فلا يغير العالم إلا الحالمون."
  }
]

const Features = () => {
  return (
    <div className='ayn__features section__padding' id='features'>
      <div className="ayn__features-heading">
        <h1 className='gradient__text'>
          المستقبل أمامك الآن وليس عليك الإ أن تنظر بعينيك. أخطُ خطواتك نحو النجاح اليوم واجعلها حقيقة.
        </h1>
        <p>سارع في طلب الإنضمام اليوم والتحق بدوراتنا.</p>
      </div>
      <div className="ayn__features-container">
        {featuresData.map((item, index) =>(
          <Feature title={item.title} text={item.text} key={item.title + index} />
        ))}
      </div>
    </div>
  )
}

export default Features